app/views/discussions/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p>
  <strong><%= @discussion.user.first_name %>:</strong>

SELECT "comments".* FROM "comments" WHERE "comments"."discussion_id" = ?  [["discussion_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <tbody>
    <% @discussion.comments.each do |comment|%>
      <tr>
        <td><strong><%= comment.user.first_name %></strong>: <%= comment.content  %>