app/views/tank_profiles/index.html.erb

  <tbody>
    <% @current_user.tank_profiles.each do |tank_profile| %>
---
SELECT "tank_profiles".* FROM "tank_profiles" WHERE "tank_profiles"."user_id" = ?  [["user_id", 2]]