app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "discussion_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asdfasfd"], ["discussion_id", 1], ["user_id", 2], ["created_at", "2018-08-24 02:39:35.639989"], ["updated_at", "2018-08-24 02:39:35.639989"]]
---
  def create
    @comment = current_user.comments.new(comment_params)

    discussion_id = @comment.discussion_id

    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_own_comment
    @comment = current_user.comments.find(params[:id])