app/controllers/discussions_controller.rb

  def index
    @discussions = Discussion.all
---
SELECT "discussions".* FROM "discussions"

  def show
    @discussion = Discussion.find(params[:id])
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @discussion = current_user.discussions.new(discussion_params)

    respond_to do |format|
      if @discussion.save
---
INSERT INTO "discussions" ("topic", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @discussion.destroy
---
DELETE FROM "discussions" WHERE "discussions"."id" = ?  [["id", 2]]

  def set_own_discussion
    begin
      @discussion =
        current_user.discussions.find(params[:id])
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."user_id" = ? AND "discussions"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]