app/controllers/photos_controller.rb

INSERT INTO "photos" ("tank_profile_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["tank_profile_id", 2], ["created_at", "2018-08-23 22:54:24.557708"], ["updated_at", "2018-08-23 22:54:24.557708"]]
---
  def create
    @photo = Photo.new(photo_params)

    if @photo.save