app/controllers/tank_profiles_controller.rb

  def index
    @tank_profiles = TankProfile.all
---
SELECT "tank_profiles".* FROM "tank_profiles"

  def show
    @tank_profile = TankProfile.find(params[:id])
---
SELECT  "tank_profiles".* FROM "tank_profiles" WHERE "tank_profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @tank_profile = current_user.tank_profiles.new(tank_profile_params)

    if @tank_profile.save
---
INSERT INTO "tank_profiles" ("profile_name", "display", "stand", "sump", "lighting", "filtration", "return_pump", "water_cirrculation", "calcium_reactor", "auto_top_off", "heating_and_cooling", "other_equipment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @tank_profile.update(tank_profile_params)
---
UPDATE "tank_profiles" SET "calcium_reactor" = ?, "updated_at" = ? WHERE "tank_profiles"."id" = ?  [["calcium_reactor", "AE 120 Calrx"], ["updated_at", "2018-08-24 05:08:44.503201"], ["id", 1]]

  def destroy
    @tank_profile.destroy
---
DELETE FROM "tank_profiles" WHERE "tank_profiles"."id" = ?  [["id", 1]]

  def home
    @tanks = TankProfile.all
---
SELECT "tank_profiles".* FROM "tank_profiles"

  def set_own_tank_profile
    @tank_profile = current_user.tank_profiles.find(params[:id])
---
SELECT  "tank_profiles".* FROM "tank_profiles" WHERE "tank_profiles"."user_id" = ? AND "tank_profiles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]